cyinsetin/test/nRF51_SDK_10.0.0/examples/ble_peripheral/ble_app_uart_with_protocol_20161115/main.c
/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of 
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);
    
    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_nus    Nordic UART Service structure.
 * @param[in] p_data   Data to be send to UART module.
 * @param[in] length   Length of the data.
 */
static void send_data_check_sum(uint8_t * p_data,uint8_t * sum1,uint8_t * sum2)
{
	uint8_t i,len,ck_a,ck_b;
	len=p_data[4];
	ck_a=ck_b=0;
	for (i=0;i<len+2;i++) 
	{
		ck_a+=p_data[i];
		ck_b+=ck_a;
	}
	*sum1=ck_a;
	*sum2=ck_b;
}
static void RX_data_check_sum(uint8_t * p_data,uint8_t * sum1,uint8_t * sum2)
{
	uint8_t i,len,ck_a,ck_b;
	len=p_data[4];
	ck_a=ck_b=0;
	for (i=0;i<len+4;i++) 
	{
		ck_a+=p_data[i];
		ck_b+=ck_a;
	}
	*sum1=ck_a;
	*sum2=ck_b;
}
/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_nus    Nordic UART Service structure.
 * @param[in] p_data   Data to be send to UART module.
 * @param[in] length   Length of the data.
 */
/**@snippet [Handling the data received over BLE] */
/*
static void nus_data_handler(ble_nus_t * p_nus, uint8_t * p_data, uint16_t length)
{
    for (uint32_t i = 0; i < length; i++)
    {
        while(app_uart_put(p_data[i]) != NRF_SUCCESS);
    }
    while(app_uart_put('\n') != NRF_SUCCESS);
}
*/
static void ble_stack_disable(void)
{
	uint32_t err_code;
	err_code = sd_nvic_DisableIRQ(SWI2_IRQn);
	APP_ERROR_CHECK(err_code);
	err_code=softdevice_handler_sd_disable();
	APP_ERROR_CHECK(err_code);
}
void reset_prepare(void)
{
	uint32_t err_code;
	err_code = sd_ble_gap_disconnect(m_conn_handle,BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
	APP_ERROR_CHECK(err_code);
	err_code=ble_conn_params_stop();
	APP_ERROR_CHECK(err_code);
	sd_ble_gap_adv_stop();
	ble_stack_disable();
	nrf_delay_ms(1000);
}
static void nus_data_handler(ble_nus_t * p_nus, uint8_t * p_data, uint16_t length)
{
		uint8_t i,ck_a,ck_b,err_f,cmd;
		//uint8_t len;
		uint8_t j;
	  uint32_t err_code;	

//		uint32_t Tx_data_length;
//	  static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
//    static uint8_t index = 0;	
    //for (uint32_t i = 0; i < length; i++)
    //{
    //    while(app_uart_put(p_data[i]) != NRF_SUCCESS);
    //}
    //while(app_uart_put('\n') != NRF_SUCCESS);
	
	/*
		err_f=false;

    for (uint32_t i = 0; i < length; i++)
    {
        while(app_uart_put(p_data[i]) != NRF_SUCCESS);
			err_code = ble_nus_string_send(&m_nus, p_data, length);
    }
		while(app_uart_put('\n') != NRF_SUCCESS);
	*/
			err_f=false;
			if (p_data[0]!=Watch_header_H) err_f=true;
			if (p_data[1]!=Watch_header_L) err_f=true;
			if (p_data[2]!=Watch_ID_H) err_f=true;
			if (!err_f) {
										//len=BT_RxBuf[4];
										//bt_rx_len=len+8;
										//ck_a=ck_b=0;
										RX_data_check_sum(p_data,&ck_a,&ck_b);				
										if ((ck_a!=p_data[length-2])||(ck_b!=p_data[length-1])) err_f=true;
									}
			/*
			if (err_f) {
										bt_rx_len=8;
										//SimpleProfile_SetParameter(SIMPLEPROFILE_CHAR4, 8, ANS_NACK);
										err_code = ble_nus_string_send(&m_nus, ANS_NAK, 7);
									} 
			*/
			else 
			{
				//SimpleProfile_SetParameter(SIMPLEPROFILE_CHAR4, 8, ANS_ACK);
				//bt_rx_len=len+8;
				//cmd=BT_RxBuf[3];
				//if (cmd!=0x07) {
						err_code = ble_nus_string_send(&m_nus, ANS_NAK, 7);
				//               }
			}
			if(!err_f)
			{
/*******command ok,run function***************************/
				//BT_TxBuf[0]=Watch_header_H;
				//BT_TxBuf[1]=Watch_header_L;
				//BT_TxBuf[2]=Watch_ID_H;
				BT_TxBuf[0]=0x07;
				//BT_TxBuf[1]=Watch_header_L;
				//BT_TxBuf[2]=Watch_ID_H;
			  cmd=p_data[3];
				switch (cmd) {
											case 0x00:	//Get Device S/N
														BT_TxBuf[1]=0;
														bt_tx_len=20;
														for(i=0;i<bt_tx_len-4;i++)
															{
																BT_TxBuf[i+2]=SN[i];
															}
														send_data_check_sum(SN,&BT_TxBuf[bt_tx_len-1],&BT_TxBuf[bt_tx_len-2]);
											      err_code = ble_nus_string_send(&m_nus, BT_TxBuf, bt_tx_len);
													break;
											case 0x01:	//Send Message
												    //BT_TxBuf[0]=Watch_header_H;
												    //BT_TxBuf[1]=Watch_header_L;
												    //BT_TxBuf[2]=Watch_ID_H;

													 err_code = ble_nus_string_send(&m_nus, ANS_ACK, 8);
													break;
											case 0x02:	//Set Watch Time
													 err_code = ble_nus_string_send(&m_nus, ANS_ACK, 8);
													break;
											case 0x03:	//Set Watch Date
														//err_code = ble_nus_string_send(&m_nus, ANS_ACK, 8);
													 err_code = ble_nus_string_send(&m_nus, ANS_ACK, 8);
													break;
											case 0x04:	//Set Watch Clock
													 err_code = ble_nus_string_send(&m_nus, ANS_ACK, 8);
												break;
											case 0x05:	//Get FW Ver
														//FW_VER
													 err_code = ble_nus_string_send(&m_nus, ANS_ACK, 8);
												break;
											case 0x06:	//ACK
													 err_code = ble_nus_string_send(&m_nus, ANS_ACK, 8);
												break;
											case 0x07:	//Set Device Name
													 err_code = ble_nus_string_send(&m_nus, ANS_ACK, 8);
												break;
											case 0x08:	//Get Device Name
														BT_TxBuf[1]=0;
														bt_tx_len=2+strlen(DEVICE_NAME)+2;
														for(i=0;i<strlen(DEVICE_NAME);i++)
															{
																BT_TxBuf[i+2]=DEVICE_NAME[i];
															}
														send_data_check_sum(SN,&BT_TxBuf[bt_tx_len-1],&BT_TxBuf[bt_tx_len-2]);
											      err_code = ble_nus_string_send(&m_nus, BT_TxBuf, bt_tx_len);
												break;
										
											case 0x09: 	//System Type
													 err_code = ble_nus_string_send(&m_nus, ANS_ACK, 8);
												break;
											case 0x0B:	//Anti-lost
														//err_code = ble_nus_string_send(&m_nus, ANS_ACK, 8);
													 err_code = ble_nus_string_send(&m_nus, ANS_ACK, 8);
												break;
											case 0x0C:	//Get Pedometer Data
														for(j=0;j<bt_rx_len;j++)
															{
																//BT_RxBuf[j];
															}
														err_code = ble_nus_string_send(&m_nus, BT_RxBuf, bt_rx_len);
												break;
											case 0x0D:	//Get Sleep Data

												break;
											case 0x0E:	//Reset Watch Data
												break;
											case 0x0F:	//NAK
												   err_code = ble_nus_string_send(&m_nus, ANS_NAK, 7);
												break;
											case 0x12:	//find cell phone
												
												break;
										
											case 0x13:	//Get BATT
														bt_rx_len=8;
														err_code = ble_nus_string_send(&m_nus, ANS_ACK, 8);
												break;
											case 0x14:	//Adj Hour Hand
														for(j=0;j<bt_rx_len;j++)
															{

