cyinsetin/test/nRF51_SDK_10.0.0/examples/ble_peripheral/ble_app_uart_with_protocol_20161115/main.c
/**@brief  Function for initializing the UART module.
 */
/**@snippet [UART Initialization] */

static void uart_init(void)
{
    uint32_t                     err_code;
    const app_uart_comm_params_t comm_params =
    {
        RX_PIN_NUMBER,
        TX_PIN_NUMBER,
        RTS_PIN_NUMBER,
        CTS_PIN_NUMBER,
        APP_UART_FLOW_CONTROL_DISABLED,
        false,
        UART_BAUDRATE_BAUDRATE_Baud38400
    };

    APP_UART_FIFO_INIT( &comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handle,
                       APP_IRQ_PRIORITY_LOW,
                       err_code);
    APP_ERROR_CHECK(err_code);
}

/**@snippet [UART Initialization] */


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    uint32_t      err_code;
    ble_advdata_t advdata;
    ble_advdata_t scanrsp;

    // Build advertising data struct to pass into @ref ble_advertising_init.
    memset(&advdata, 0, sizeof(advdata));
    advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance = false;
    advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

    memset(&scanrsp, 0, sizeof(scanrsp));
    scanrsp.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    scanrsp.uuids_complete.p_uuids  = m_adv_uuids;

    ble_adv_modes_config_t options = {0};
    options.ble_adv_fast_enabled  = BLE_ADV_FAST_ENABLED;
    options.ble_adv_fast_interval = APP_ADV_INTERVAL;
    options.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;

    err_code = ble_advertising_init(&advdata, &scanrsp, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS,
                                 APP_TIMER_TICKS(100, APP_TIMER_PRESCALER), 
                                 bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for placing the application in low power state while waiting for events.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}

void copystr(uint8_t *str1,uint8_t *str2)
{
	uint8_t i;
	for(i=0;i<strlen((char*)str2);i++)
	{
		str1[i]=str2[i];
	}
}

static void hand_control_event_handler(nrf_timer_event_t event_type, void* p_context)
{
	//uint32_t err_code;
	switch(Hand_activity_mode)			//处理工作模式
	{
		case Time_Mode_index:					//0:Time Mode
					if(Minute_Hand_One_Step_flg==1)
					{
						Minute_Hand_Clockwise(&Minute_Hand_Position,&Minute_Hand_Clockwise_Step_Cnt);			//分针顺时针处理
						if(Minute_Hand_Clockwise_Step_Cnt>=1)
						{
							Minute_Hand_One_Step_flg=0;
							Minute_Hand_Clockwise_Step_Cnt = 0;
						}
					}
					if(Hour_Hand_One_Step_flg==1)
					{
						Hour_Hand_Clockwise(&Hour_Hand_Position,&Hour_Hand_Clockwise_Step_Cnt);
						if(Hour_Hand_Clockwise_Step_Cnt>=1)
						{
							Hour_Hand_One_Step_flg=0;
							Hour_Hand_Clockwise_Step_Cnt = 0;
						}
					}
					if(Hour_Hand_One_Step_flg==0 && Minute_Hand_One_Step_flg==0)
					{
						nrf_drv_timer_disable(&Hand_Control);
						//Disable_Hand_Ctrl();
					}
			break;
		case Show_Date_BAT_index:					//1:Show Date & Battery Capacity
			switch(Show_Date_Batt_mode_step)
			{
				case 0:		//初值
							Hour_Hand_Clockwise_Step_Cnt=0;
							Minute_Hand_Clockwise_Step_Cnt=0;
							Second_Hand_Clockwise_Step_Cnt=0;
							Show_Date_Batt_mode_step=1;		
				case 1:		//Minute Hand Show Date
			      if(Minute_Hand_Position!=date_position[calendar.w_date])							
						{
						  Minute_Hand_Clockwise(&Minute_Hand_Position,&Minute_Hand_Clockwise_Step_Cnt);
							if(Minute_Hand_Clockwise_Step_Cnt>=1)
							{
								Minute_Hand_Clockwise_Step_Cnt=0;
								if(Minute_Hand_Position>=180)
								{
									Minute_Hand_Position = 0;
								}
							}
						}						 
						else
						{
							Minute_Hand_Clockwise_Step_Cnt = 0;
							//Show_Date_Batt_mode_step=2;
						}
					//break;
				case 2:		//Hour Hnad Show Week

 		        if(Hour_Hand_Position!=weeks_position[calendar.week])
					 	{
							Hour_Hand_Clockwise(&Hour_Hand_Position,&Hour_Hand_Clockwise_Step_Cnt);
							if(Hour_Hand_Clockwise_Step_Cnt>=1)
							{
								Hour_Hand_Clockwise_Step_Cnt=0;
								if(Hour_Hand_Position>=180)
								{
									Hour_Hand_Position = 0;
								}
							}
						}		
						else
						{
							Hour_Hand_Clockwise_Step_Cnt = 0;
							//Show_Date_Batt_mode_step=3;
						}
						if((Minute_Hand_Position==date_position[calendar.w_date]) && (Hour_Hand_Position==weeks_position[calendar.week]))
						{
							Show_Date_Batt_mode_step=3;
						}
					break;
				case 3:		//Small Hand Show Battery Level

					Start_Show_value=NRF_RTC1->COUNTER;
				  //Show_Date_Batt_mode_step++;
					Show_Date_Batt_mode_step=4;
					break;
				case 4:		//Delay 5'S and Then Goto Time Mode
							if((NRF_RTC1->COUNTER-Start_Show_value)>40)
							{
								Show_Date_Batt_mode_step=0;
								Hand_activity_mode=8;
							}
					break;
				default:
					break;
			}			
			break;
		case BLE_On_Mode_index:					//2:BLE On Mode
			switch(BLE_On_Mode_step)
			{
				case 0:

					break;
				case 1:
					break;
				case 2:
					break;
				default:
					break;
			}			
			break;
		case BLE_Off_Mode_index:					//3:BLE Off Mode
			switch(BLE_Off_Mode_step)
			{
				case 0:
					break;
				case 1:
					break;
				case 2:
					break;
				default:
					break;
			}			
			break;
		case BAT_Low_Vol_Mode_index:					//4:Battery Low Voltage Mode
			switch(Battery_Low_Voltage_Mode_step)
			{
				case 0:
					break;
				case 1:
					break;
				case 2:
					break;
				default:
					break;
			}			
			break;
		case Hand_Calibration_Mode_index:					//5:Pointer Calibration Mode
			switch(Pointer_Calibration_mode_step)
			{

				case 0:			//2:Minute hand running 64hz
							//nrf_drv_rtc_tick_enable(&rtc,true);
//							nrf_drv_rtc_tick_disable(&rtc);
						  Pointer_Calibration_mode_step=1;
					break;
				case 1:
							Minute_Hand_Clockwise(&Minute_Hand_Position,&Minute_Hand_Clockwise_Step_Cnt);
							if(key_pause_short_flg)
							{
								key_pause_short_flg=0;								
								Pointer_Calibration_mode_step=2;
							}
					break;
				case 2:			//3:Minute hand running 1 step/key
							if(key_pause_short_flg)
							{
								key_pause_short_flg=0;								
								One_step_flg=1;
							}
							else if(key_pause_3s_flg)
							{
								key_pause_3s_flg=0;								
								Pointer_Calibration_mode_step=3;
							}
							if(One_step_flg==1)
							{
								Minute_Hand_Clockwise(&Minute_Hand_Position,&Minute_Hand_Clockwise_Step_Cnt);
								if(Minute_Hand_Clockwise_Step_Cnt>=1)
								{
									Minute_Hand_Clockwise_Step_Cnt=0;
									One_step_flg=0;
								}
							}							
					break;
				case 3:			//4:Hour hand running 64hz
							Hour_Hand_Clockwise(&Hour_Hand_Position,&Hour_Hand_Clockwise_Step_Cnt);
							if(key_pause_short_flg)
							{
								key_pause_short_flg=0;								
								Pointer_Calibration_mode_step=4;
							}				
					break;
				case 4:			//5:Hour hand running 1 step/key
							if(key_pause_short_flg)
							{
								key_pause_short_flg=0;
								One_step_flg=1;
							}
							else if(key_pause_3s_flg)
							{
								key_pause_3s_flg=0;
								Pointer_Calibration_mode_step=5;
							}
							if(One_step_flg==1)
							{
								Hour_Hand_Clockwise(&Hour_Hand_Position,&Hour_Hand_Clockwise_Step_Cnt);
								if(Hour_Hand_Clockwise_Step_Cnt>=1)
								{
									Hour_Hand_Clockwise_Step_Cnt=0;
									One_step_flg=0;
								}
							}									
					break;		
				case 5:			//0:Small hand running 64hz
							Second_Hand_Clockwise(&Second_Hand_Position,&Second_Hand_Clockwise_Step_Cnt);
							if(key_pause_short_flg==1)
							{
								key_pause_short_flg=0;
								Pointer_Calibration_mode_step=6;
							}
					break;
				case 6:			//1:Small hand running 1 step/key
							if(key_pause_short_flg)
							{
								key_pause_short_flg=0;								
								//Second_Hand_Clockwise();
								One_step_flg=1;
							}
							else if(key_pause_3s_flg)
							{
								key_pause_3s_flg=0;								
								Pointer_Calibration_mode_step=7;
							}
							if(One_step_flg==1)
							{
								Second_Hand_Clockwise(&Second_Hand_Position,&Second_Hand_Clockwise_Step_Cnt);
								if(Second_Hand_Clockwise_Step_Cnt>=1)
								{
									Second_Hand_Clockwise_Step_Cnt=0;
									One_step_flg=0;
								}
							}
					break;
				case 7:			//6:All Hand Show Time And Status,Set Step to zero	
					    key_pause_short_flg=0;
							key_pause_3s_flg=0;

