cyinsetin/test/nRF51_SDK_10.0.0/examples/ble_peripheral/ble_app_uart_with_protocol_20161115/main.c
							Second_Hand_Position=0;  									//The Current Position of Second Hand
							Minute_Hand_Position=0;										//The Current Position of Minute Hand
							Hour_Hand_Position=0;											//The Current Position of Hour Hand
							Small_Hand_Top_Position=0;  								//The Current Position of Status Hand
							Small_Hand_Buttom_Position=0;  						//The Current Position of Status Hand
							Small_Hand_Right_Position=0;  							//The Current Position of Status Hand
							Small_Hand_Left_Position=0;  							//The Current Position of Status Hand
					    Pointer_Calibration_mode_step=0;
				
							Hand_activity_mode=Chasing_Time_index;
				      Chasing_Time_step=0;
				      Show_Date_Batt_mode_step=0;
							//nrf_drv_timer_disable(&Hand_Control);
				      //nrf_drv_rtc_tick_enable(&rtc,true);
					break;						
				default:
					break;
																									
			}			
			break;
		case Power_Off_Mode_index:					//6:Power Off Mode
			switch(Power_Off_Mode_step)
			{
				case 0:		//Hour Hand Show Time
							if(Hour_Hand_Position!=0)
							{
								Hour_Hand_Clockwise(&Hour_Hand_Position,&Hour_Hand_Clockwise_Step_Cnt);
								if(Hour_Hand_Clockwise_Step_Cnt>=1)
								{
									Hour_Hand_Clockwise_Step_Cnt=0;
									if(Hour_Hand_Position>=180)
									{
										Hour_Hand_Position=0;
									}
								}
							}
				      if(Hour_Hand_Position==0)
							{
								Hour_Hand_Clockwise_Step_Cnt = 0;
								Power_Off_Mode_step=1;
							}
					break;
				case 1:		//Minute Hand Show Time
					   if(Minute_Hand_Position!=0)
						 {
								Minute_Hand_Clockwise(&Minute_Hand_Position,&Minute_Hand_Clockwise_Step_Cnt);
								if(Minute_Hand_Clockwise_Step_Cnt>=1)
								{
									Minute_Hand_Clockwise_Step_Cnt=0;
									if(Minute_Hand_Position>=180)
									{
										Minute_Hand_Position=0;
									}									
								}
						  }
				      if(Minute_Hand_Position==0)
							{
								Minute_Hand_Clockwise_Step_Cnt = 0;
								Power_Off_Mode_step=2;
							}
					break;
				case 2:		//Small Hand Show Pedometer
							if(Second_Hand_Position!=0)
							{
								Second_Hand_Clockwise(&Second_Hand_Position,&Second_Hand_Clockwise_Step_Cnt);
								if(Second_Hand_Clockwise_Step_Cnt>=1)
								{
									Second_Hand_Clockwise_Step_Cnt=0;
									if(Second_Hand_Position>=180)
									{
										Second_Hand_Position=0;
									}	
								}
							}
				      if(Second_Hand_Position==0)
							{
								Second_Hand_Clockwise_Step_Cnt = 0;
								Power_Off_Mode_step=3;
							}
					break;				
				case 3:
							//Hand_activity_mode=Time_Mode_index;
							Power_Off_Mode_step=0;
							nrf_drv_timer_disable(&Hand_Control);
//							nrf_drv_rtc_tick_disable(&rtc);
					break;		
        default:
				  break;
	    }			
	
			break;
		case Power_On_Mode_index:					//7:Power On Mode
			switch(Power_On_Mode_step)
			{
				case 0:
					break;
				case 1:
					break;
				case 2:
					break;
				default:
					break;
			}
			break;
		case Chasing_Time_index:					//8:Chasing Time Mode
			switch(Chasing_Time_step)
			{
				case 0:
							RTC_CNT= RTC_TIME_BASE + (NRF_RTC1->COUNTER/8) ;
							RTC_Get(RTC_CNT);
							calculate_RTC_Position(calendar.hour,calendar.min,calendar.sec,&RTC_Hour_Hand_Position,&RTC_Minute_Hand_Position,&RTC_Second_Hand_Position);									
							Hour_Hand_Clockwise_Step_Cnt=0;
							Minute_Hand_Clockwise_Step_Cnt=0;
							Second_Hand_Clockwise_Step_Cnt=0;
							Chasing_Time_step=1;
				case 1:		//Hour Hand Show Time
							if(Hour_Hand_Position!=RTC_Hour_Hand_Position)
							{
								Hour_Hand_Clockwise(&Hour_Hand_Position,&Hour_Hand_Clockwise_Step_Cnt);
								if(Hour_Hand_Clockwise_Step_Cnt>=1)
								{
									Hour_Hand_Clockwise_Step_Cnt=0;
									if(Hour_Hand_Position>=180)
									{
										Hour_Hand_Position=0;
									}
								}
							}
				      else if(Hour_Hand_Position==RTC_Hour_Hand_Position)
							{
								Hour_Hand_Clockwise_Step_Cnt = 0;
								//Chasing_Time_step=2;
							}
					//break;
				case 2:		//Minute Hand Show Time
							if(Minute_Hand_Position!=RTC_Minute_Hand_Position)
							{
								Minute_Hand_Clockwise(&Minute_Hand_Position,&Minute_Hand_Clockwise_Step_Cnt);
								if(Minute_Hand_Clockwise_Step_Cnt>=1)
								{
									Minute_Hand_Clockwise_Step_Cnt=0;
									if(Minute_Hand_Position>=180)
									{
										Minute_Hand_Position=0;
									}								
								}
							}
				      else if(Minute_Hand_Position==RTC_Minute_Hand_Position)
							{
								Minute_Hand_Clockwise_Step_Cnt = 0;
								//Chasing_Time_step=3;
							}
					//break;
				case 3:		//Small Hand Show Pedometer
						 if(Second_Hand_Position!=Pedometer_Position)
						 {
							 Second_Hand_Clockwise(&Second_Hand_Position,&Second_Hand_Clockwise_Step_Cnt);
				      if(Second_Hand_Clockwise_Step_Cnt>=1)
							{
								Second_Hand_Clockwise_Step_Cnt=0;
								if(Second_Hand_Position>=180)
								{
									Second_Hand_Position=0;
								}	
							}	
						 }
				     else if(Second_Hand_Position==RTC_Second_Hand_Position)
							{
								Second_Hand_Clockwise_Step_Cnt = 0;
								//Chasing_Time_step=4;
							}
							if((Hour_Hand_Position==RTC_Hour_Hand_Position)&&(Minute_Hand_Position==RTC_Minute_Hand_Position)&&(Second_Hand_Position==Pedometer_Position))
							{
								Chasing_Time_step=4;
							}
					break;				
				case 4:
							Hand_activity_mode=Time_Mode_index;
							Chasing_Time_step=0;
							nrf_drv_timer_disable(&Hand_Control);
//							nrf_drv_rtc_tick_enable(&rtc,true);
					break;
				default:
					break;
			}
			break;
			
		case Hand_To_Zero_Mode_index:					//9:Hand To Zero Mode
			switch(Hand_To_Zero_Mode_step){
				case 0:		//Hour Hand Show Time
							if(Hour_Hand_Position!=0)
							{
								Hour_Hand_Clockwise(&Hour_Hand_Position,&Hour_Hand_Clockwise_Step_Cnt);
								if(Hour_Hand_Clockwise_Step_Cnt>=1)
								{
									Hour_Hand_Clockwise_Step_Cnt=0;
									if(Hour_Hand_Position>=180)
									{
										Hour_Hand_Position=0;
									}
								}
							}
				      if(Hour_Hand_Position==0)
							{
								Hour_Hand_Clockwise_Step_Cnt = 0;
								Power_Off_Mode_step=1;
							}
					break;
				case 1:		//Minute Hand Show Time
					   if(Minute_Hand_Position!=0)
						 {
								Minute_Hand_Clockwise(&Minute_Hand_Position,&Minute_Hand_Clockwise_Step_Cnt);
								if(Minute_Hand_Clockwise_Step_Cnt>=1)
								{
									Minute_Hand_Clockwise_Step_Cnt=0;
									if(Minute_Hand_Position>=180)
									{
										Minute_Hand_Position=0;
									}									
								}
						  }
				      if(Minute_Hand_Position==0)
							{
								Minute_Hand_Clockwise_Step_Cnt = 0;
								Power_Off_Mode_step=2;
							}
					break;
				case 2:		//Small Hand Show Pedometer
							if(Second_Hand_Position!=0)
							{
								Second_Hand_Clockwise(&Second_Hand_Position,&Second_Hand_Clockwise_Step_Cnt);
								if(Second_Hand_Clockwise_Step_Cnt>=1)
								{
									Second_Hand_Clockwise_Step_Cnt=0;
									if(Second_Hand_Position>=180)
									{
										Second_Hand_Position=0;
									}	
								}
							}
				      if(Second_Hand_Position==0)
							{
								Second_Hand_Clockwise_Step_Cnt = 0;
								Power_Off_Mode_step=3;
							}
					break;				
				case 3:
							Hand_activity_mode=Time_Mode_index;
							Hand_To_Zero_Mode_step=0;
							nrf_drv_timer_disable(&Hand_Control);
//							nrf_drv_rtc_tick_disable(&rtc);
					break;		
        default:
				  break;
	    }
			break;
		case Hand_Calibration_Mode_for_BLE:
			//switch(Hand_To_Zero_Mode_step){
			switch(Hand_Calibration_Mode_for_BLE_step)
			{
				case 0:		//Hour Hand Show Time
							if(Hour_Hand_Position!=0)
							{
								Hour_Hand_Clockwise(&Hour_Hand_Position,&Hour_Hand_Clockwise_Step_Cnt);
								if(Hour_Hand_Clockwise_Step_Cnt>=1)
								{
									Hour_Hand_Clockwise_Step_Cnt=0;
									if(Hour_Hand_Position>=180)
									{
										Hour_Hand_Position=0;
									}
								}
							}
				      if(Hour_Hand_Position==0)
							{
								Hour_Hand_Clockwise_Step_Cnt = 0;
								Hand_Calibration_Mode_for_BLE_step=1;
							}
					break;
				case 1:		//Minute Hand Show Time
					   if(Minute_Hand_Position!=0)
						 {
								Minute_Hand_Clockwise(&Minute_Hand_Position,&Minute_Hand_Clockwise_Step_Cnt);
								if(Minute_Hand_Clockwise_Step_Cnt>=1)
								{
									Minute_Hand_Clockwise_Step_Cnt=0;
									if(Minute_Hand_Position>=180)
									{
										Minute_Hand_Position=0;
									}									
								}
						  }
				      if(Minute_Hand_Position==0)
							{
								Minute_Hand_Clockwise_Step_Cnt = 0;
								Hand_Calibration_Mode_for_BLE_step=2;
							}
					break;
				case 2:	
							if(Second_Hand_Position!=0)
							{
								Second_Hand_Clockwise(&Second_Hand_Position,&Second_Hand_Clockwise_Step_Cnt);
								if(Second_Hand_Clockwise_Step_Cnt>=1)
								{
									Second_Hand_Clockwise_Step_Cnt=0;
									if(Second_Hand_Position>=180)
									{
										Second_Hand_Position=0;
									}	
								}
							}
				      if(Second_Hand_Position==0)
							{
								Second_Hand_Clockwise_Step_Cnt = 0;
								Hand_Calibration_Mode_for_BLE_step=3;
							}
					break;				
				case 3:
							Hand_activity_mode=Chasing_Time_index;
							Hand_Calibration_Mode_for_BLE_step=0;
							nrf_drv_timer_disable(&Hand_Control);
//							nrf_drv_rtc_tick_disable(&rtc);
					break;		
        default:
				  break;
	    }
			break;
		default:
			break;
	}
}

//static void Key_Scan_event_handler(void* p_context)

static void Key_Scan_event_handler(nrf_timer_event_t event_type, void* p_context)
{
		key_press_cnt++;
		if(nrf_gpio_pin_read(KEY_IO)==1)
		{
			//key_press_flg=1;
			//BT_CNT[0]++;
			if(key_press_cnt>10 && key_press_cnt<50)
			{
				Vibrator_off();
			}
			else if(key_press_cnt>50 && key_press_cnt<300)
			{
				Vibrator_off();
			}
			else if(key_press_cnt>300 && key_press_cnt<320)
			{
				Vibrator_on();
			}
			else if(key_press_cnt>320 && key_press_cnt<500)
			{
				Vibrator_off();
			}			
			else if(key_press_cnt>500 && key_press_cnt<520)
			{
				Vibrator_on();
			}
			else if(key_press_cnt>520 && key_press_cnt<1000)
			{
				Vibrator_off();
			}		
			else if(key_press_cnt>1000 && key_press_cnt<1020)
			{
				Vibrator_on();
			}
			else if(key_press_cnt>1020 && key_press_cnt<1500)
			{
				Vibrator_off();
			}
		}
		else if(nrf_gpio_pin_read(KEY_IO)==0)
		{
			Vibrator_off();
		 if(key_press_cnt>5 && key_press_cnt<25)
			 {
				key_pause_short_flg=1;
				key_pause_3s_flg=0;
				key_pause_5s_flg=0;
				key_pause_10s_flg=0;
				if(Hand_activity_mode==Time_Mode_index)
				{
					key_press_times_cnt++;
					if(key_press_times_cnt>=2)
					{
						
