cyinsetin/test/nRF51_SDK_10.0.0/examples/ble_peripheral/ble_app_uart_with_protocol_20161115/main.c
					}
				}
			 }
			 else if(key_press_cnt>25 && key_press_cnt<300)
			 {
				key_pause_short_flg=1;
				key_pause_3s_flg=0;
				key_pause_5s_flg=0;
				key_pause_10s_flg=0;
				if(Hand_activity_mode==Time_Mode_index)
				{
					nrf_adc_start();
			    adc_sample=adc_sample;
					Hand_activity_mode=Show_Date_BAT_index;
					nrf_drv_timer_enable(&Hand_Control);
				}
			 }			 
			 else if(key_press_cnt>300 && key_press_cnt<500)
			 {
				key_pause_short_flg=0;
				key_pause_3s_flg=1;
				key_pause_5s_flg=0;
				key_pause_10s_flg=0;
				if(Hand_activity_mode==Time_Mode_index)
				{
					Hand_activity_mode=Hand_Calibration_Mode_index;
					nrf_drv_timer_enable(&Hand_Control);
				}
			 }
			 else if(key_press_cnt>500 && key_press_cnt<1000)
			 {
				key_pause_short_flg=0;
				key_pause_3s_flg=0;
				key_pause_5s_flg=1;
				key_pause_10s_flg=0;
				 
				//if(Hand_activity_mode==Time_Mode_index)
				//{
			//		Hand_activity_mode=5;
				//}			 
			 }
			 else if(key_press_cnt>1000 && key_press_cnt<1500)
			 {
				key_pause_short_flg=0;
				key_pause_3s_flg=0;
				key_pause_5s_flg=0;
				key_pause_10s_flg=1;
				if(Hand_activity_mode==Time_Mode_index)
				{
					Hand_activity_mode=Power_Off_Mode_index;
					nrf_drv_timer_enable(&Hand_Control);
				}					 
			 }
			 key_press_cnt=0;
				//nrf_drv_timer_disable(&Key_Scan);
			  //uint32_t err_code = app_timer_stop(m_button_a_timer_id);
			  nrf_drv_timer_disable(&Button_Control);
        //APP_ERROR_CHECK(err_code);
				//key_press_cnt=NRF_RTC0->COUNTER-key_press_time;
				//key_press_cnt=0;
			  //key_press_flg=0;
		}

	//nrf_drv_timer_enable(&Key_Scan);

}

/**@brief Application main function.
 */
int main(void)
{
    uint32_t err_code;
//		uint8_t s,i;
    bool erase_bonds;
    uint8_t start_string[] = START_STRING;
//    uint8_t ck_a,ck_b;
	  //copystr(DEVICE_NAME,start_string);
    //sprintf((char *)DEVICE_NAME,*start_string);
    // Initialize.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);			//APP定时器初始化
    uart_init();															//Uart串口初始化，端口配置等
    buttons_leds_init(&erase_bonds);					//按键和LED初始化配置
    ble_stack_init();													//蓝牙协议栈初始化
    gap_params_init();												//
    services_init();													//设备信息初始化
    advertising_init();												//
    conn_params_init();												//
    adc_config();															//
	  nrf_adc_start();													//
	
	  nrf_delay_ms(1000);

    printf("%s",start_string);

    //err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    //APP_ERROR_CHECK(err_code);
    //check_sum(&ANS_NAK[0],&ck_a,&ck_b);	
    // Enter main loop.
    err_code = nrf_drv_timer_init(&Hand_Control, NULL, hand_control_event_handler);
    APP_ERROR_CHECK(err_code);
    err_code = nrf_drv_timer_init(&Button_Control, NULL, Key_Scan_event_handler);
    APP_ERROR_CHECK(err_code);
		//rtc_config();
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
		    APP_ERROR_CHECK(err_code);
    for (;;)
    {
        power_manage();
    }
}


/** 
 * @}
 */
